app/controllers/admin/categories_controller.rb

    def remove
        category = Category.find(params['id'])
        category.delete
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", "3"]]
DELETE FROM "categories" WHERE "categories"."id" = 3

    def create

       # render :text => params

        if params['id'] == nil
            category = Category.new
        else
            category = Category.find(params['id'])
        end

        category.name = params['name']
        category.save
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", "3"]]
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Thu, 18 Oct 2012 12:25:40 UTC +00:00], ["name", "abc"], ["updated_at", Thu, 18 Oct 2012 12:25:40 UTC +00:00]]
UPDATE "categories" SET "name" = 'abc2', "updated_at" = '2012-10-18 12:28:20.658307' WHERE "categories"."id" = 3

    def edit
        @category = Category.find(params['id'])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", "3"]]