app/controllers/admin/products_controller.rb

    def remove
        product = Product.find(params['id'])
        product.delete
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", "9"]]
DELETE FROM "products" WHERE "products"."id" = 9

    def new
        @categories = Category.all
---
SELECT "categories".* FROM "categories"

    def create
       # render :text => params

        if params['id'] == nil
            product = Product.new
        else
            product = Product.find(params['id'])
        end

        product.name = params['name']
        product.category_id = params['category_id']
        product.price = params['price'].to_i * 100
        product.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", "5"]]
INSERT INTO "products" ("category_id", "created_at", "name", "price", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category_id", 1], ["created_at", Thu, 18 Oct 2012 12:07:11 UTC +00:00], ["name", ""], ["price", nil], ["updated_at", Thu, 18 Oct 2012 12:07:11 UTC +00:00]]
UPDATE "products" SET "name" = 'NFS MostWanted v2', "category_id" = 1, "price" = 100, "updated_at" = '2012-10-18 12:20:49.110802' WHERE "products"."id" = 3

    def edit
        @categories = Category.all
        @product = Product.find(params['id'])
---
SELECT "categories".* FROM "categories"
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", "4"]]