app/views/admin/orders/index.html.erb

SELECT "order_items".* FROM "order_items" WHERE (order_id = 5)
SELECT "orders".* FROM "orders"
---
            @orders.each do |order|
                if order.confirmed == true && order.getOrderItems.size > 0