app/views/orders/_template.html.erb

<%
   if @buyer.orders[0].getOrderItems.size == 0
---
SELECT "order_items".* FROM "order_items" WHERE (order_id = 19)
SELECT "orders".* FROM "orders" WHERE "orders"."buyer_id" = 19