app/views/orders/index.html.erb

           else
                @order.getOrderItems.each do |item| %>
---
SELECT "order_items".* FROM "order_items" WHERE (order_id = 29)