app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "categories".* FROM "categories"
---
    def show
        @category = Category.find(params[:id])
        @products = @category.products
        @categories = Category.all