app/controllers/orders_controller.rb

    def index
        chceckBuyerSession

        @order = @buyer.orders[0]
---
SELECT "orders".* FROM "orders" WHERE "orders"."buyer_id" = 45

    def create

        session[:buyer_id] = params[:buyer_id]

        @buyer2 = Buyer.find(params[:buyer_id])

        orderItem = OrderItem.new
        orderItem.order_id = @buyer2.orders[0].id
        orderItem.product_id = params['product_id']
        orderItem.quantity = params['quantity']
        orderItem.price = params['price']
        orderItem.save
---
SELECT "buyers".* FROM "buyers" WHERE "buyers"."id" = $1 LIMIT 1  [["id", "19"]]
SELECT "orders".* FROM "orders" WHERE "orders"."buyer_id" = 12
INSERT INTO "buyers" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", Thu, 18 Oct 2012 09:08:31 UTC +00:00], ["updated_at", Thu, 18 Oct 2012 09:08:31 UTC +00:00]]
INSERT INTO "order_items" ("created_at", "order_id", "price", "product_id", "quantity", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Thu, 18 Oct 2012 09:19:52 UTC +00:00], ["order_id", 1], ["price", nil], ["product_id", 4], ["quantity", 1], ["updated_at", Thu, 18 Oct 2012 09:19:52 UTC +00:00]]
INSERT INTO "orders" ("buyer_id", "confirmed", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["buyer_id", 14], ["confirmed", nil], ["created_at", Thu, 18 Oct 2012 09:10:39 UTC +00:00], ["updated_at", Thu, 18 Oct 2012 09:10:39 UTC +00:00]]

    def remove
        OrderItem.find(params['id']).delete
---
DELETE FROM "order_items" WHERE "order_items"."id" = 10
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = $1 LIMIT 1  [["id", "10"]]

    def accept
        chceckBuyerSession

        @buyer.orders[0].confirmed = 1
        @buyer.orders[0].save
---
SELECT "orders".* FROM "orders" WHERE "orders"."buyer_id" = 14
UPDATE "orders" SET "confirmed" = 't', "updated_at" = '2012-10-20 19:06:57.182261' WHERE "orders"."id" = 14