app/controllers/search_controller.rb

    def index
        chceckBuyerSession

        if params[:price_to] == ''
            params[:price_to] = '9999999'
        end

        if params[:price_from] == ''
            params[:price_from] = '0'
        end

        @products = Product.search(:name_cont => params[:search], :price_gteq => params[:price_from].to_i*100, :price_lteq => params[:price_to].to_i*100).result(:distinct => true);
---
SELECT DISTINCT "products".* FROM "products" WHERE (("products"."name" ILIKE '%a%' AND "products"."price" >= 1111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111 AND "products"."price" <= 2222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222))