app/controllers/shop_controller.rb

    def index

        @products = Product.all
        @categories = Category.all
---
SELECT "products".* FROM "products"
SELECT "categories".* FROM "categories"